src/DataProcessors/ирКонсольЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ирКонсольЗапросов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключатьДеревоЗапросаПриОтладке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьВТранзакции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеревоЗапросов</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксСтрокДляСложнойВедомойСтруктуры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВедомуюСтруктуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КлассыWMI</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаПодключения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ирКонсольЗапросов/Forms/Настройки/Ext/Form/Module.bsl
// Обработчик нажатия кнопки ОК
//
Процедура КнопкаОКНажатие(Элемент)

	ЭтотОбъект.ВключатьДеревоЗапросаПриОтладке = фВключатьДеревоЗапросаПриОтладке;
	ЭтотОбъект.МаксСтрокДляСложнойВедомойСтруктуры = фМаксСтрокДляСложнойВедомойСтруктуры;
	ЭтотОбъект.ПоказыватьВедомуюСтруктуру = фПоказыватьВедомуюСтруктуру;
	ПараметрыОчистки = Новый Структура;
	ПараметрыОчистки.Вставить("Период", ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут);
	ПараметрыОчистки.Вставить("ПоУмолчаниюОчищать", ПоУмолчаниюОчищать);
	мПлатформа.ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут = ПараметрыОчистки;
	мПлатформа.СохранитьОбщиеНастройки();
	Закрыть(Истина);

КонецПроцедуры

// Обработчик события перед открытием формы
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	мПлатформа.ПрочитатьОбщиеНастройки();
	ЭтаФорма.фВключатьДеревоЗапросаПриОтладке = ЭтотОбъект.ВключатьДеревоЗапросаПриОтладке;
	ЭтаФорма.фМаксСтрокДляСложнойВедомойСтруктуры = ЭтотОбъект.МаксСтрокДляСложнойВедомойСтруктуры;
	ЭтаФорма.фПоказыватьВедомуюСтруктуру = ЭтотОбъект.ПоказыватьВедомуюСтруктуру;
	ЭтаФорма.ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут = ирКлиент.ПериодОчисткиМенеджераВременныхТаблицЛкс(ПоУмолчаниюОчищать);

КонецПроцедуры

Процедура ПриОткрытии()
	ирКлиент.Форма_ПриОткрытииЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ПриЗакрытии()
	ирКлиент.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт 
	
	ирКлиент.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);

КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирКонсольЗапросов.Форма.Настройки");

СписокВыбора = ЭлементыФормы.ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут.СписокВыбора;
СписокВыбора.Добавить(30);
СписокВыбора.Добавить(60);
СписокВыбора.Добавить(120);
СписокВыбора.Добавить(240); 

СписокВыбора = ЭлементыФормы.МаксСтрокДляСложнойВедомойСтруктуры.СписокВыбора;
СписокВыбора.Добавить(200);
СписокВыбора.Добавить(500);
СписокВыбора.Добавить(1000);
СписокВыбора.Добавить(2000);
